TiendaOnline3/build/PedidoLibros.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="PedidoLibros" targetNamespace="http://j2ee.netbeans.org/wsdl/TiendaOnline3/src/PedidoLibros"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/TiendaOnline3/src/PedidoLibros" xmlns:ns="http://xml.netbeans.org/schema/TiendaOnlineXML" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/TiendaOnline3/src/PedidoLibros">
            <xsd:import namespace="http://xml.netbeans.org/schema/TiendaOnlineXML" schemaLocation="TiendaOnlineXML.xsd"/>
        </xsd:schema>
    </types>
    <message name="PedidoLibrosOperationRequest">
        <part name="part1" element="ns:InputElement"/>
    </message>
    <message name="PedidoLibrosOperationResponse">
        <part name="part1" element="ns:RespuestaElement"/>
    </message>
    <portType name="PedidoLibrosPortType">
        <operation name="PedidoLibrosOperation">
            <input name="input1" message="tns:PedidoLibrosOperationRequest"/>
            <output name="output1" message="tns:PedidoLibrosOperationResponse"/>
        </operation>
    </portType>
    <plnk:partnerLinkType name="PedidoLibros">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="PedidoLibrosPortTypeRole" portType="tns:PedidoLibrosPortType"/>
    </plnk:partnerLinkType>
</definitions>
